Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 1, 1, 213)    0                                            
__________________________________________________________________________________________________
gaussian_noise_1 (GaussianNoise (None, 1, 1, 213)    0           input_1[0][0]                    
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)  (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
up_sampling2d_10 (UpSampling2D) (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
up_sampling2d_13 (UpSampling2D) (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
up_sampling2d_16 (UpSampling2D) (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
up_sampling2d_19 (UpSampling2D) (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
up_sampling2d_22 (UpSampling2D) (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
up_sampling2d_25 (UpSampling2D) (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
up_sampling2d_28 (UpSampling2D) (None, 3, 3, 213)    0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 3, 3, 256)    491008      up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 3, 3, 256)    491008      up_sampling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 3, 3, 256)    491008      up_sampling2d_7[0][0]            
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 3, 3, 256)    491008      up_sampling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 3, 3, 256)    491008      up_sampling2d_13[0][0]           
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 3, 3, 256)    491008      up_sampling2d_16[0][0]           
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 3, 3, 256)    491008      up_sampling2d_19[0][0]           
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 3, 3, 256)    491008      up_sampling2d_22[0][0]           
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 3, 3, 256)    491008      up_sampling2d_25[0][0]           
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 3, 3, 256)    491008      up_sampling2d_28[0][0]           
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 3, 3, 256)    0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 3, 3, 256)    0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 3, 3, 256)    0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 3, 3, 256)    0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 3, 3, 256)    0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 3, 3, 256)    0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 3, 3, 256)    0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 3, 3, 256)    0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 3, 3, 256)    0           conv2d_25[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 3, 3, 256)    0           conv2d_28[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 9, 9, 256)    0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 9, 9, 256)    0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
up_sampling2d_8 (UpSampling2D)  (None, 9, 9, 256)    0           leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
up_sampling2d_11 (UpSampling2D) (None, 9, 9, 256)    0           leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
up_sampling2d_14 (UpSampling2D) (None, 9, 9, 256)    0           leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
up_sampling2d_17 (UpSampling2D) (None, 9, 9, 256)    0           leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
up_sampling2d_20 (UpSampling2D) (None, 9, 9, 256)    0           leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
up_sampling2d_23 (UpSampling2D) (None, 9, 9, 256)    0           leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
up_sampling2d_26 (UpSampling2D) (None, 9, 9, 256)    0           leaky_re_lu_25[0][0]             
__________________________________________________________________________________________________
up_sampling2d_29 (UpSampling2D) (None, 9, 9, 256)    0           leaky_re_lu_28[0][0]             
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 9, 9, 128)    295040      up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 9, 9, 128)    295040      up_sampling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 9, 9, 128)    295040      up_sampling2d_8[0][0]            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 9, 9, 128)    295040      up_sampling2d_11[0][0]           
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 9, 9, 128)    295040      up_sampling2d_14[0][0]           
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 9, 9, 128)    295040      up_sampling2d_17[0][0]           
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 9, 9, 128)    295040      up_sampling2d_20[0][0]           
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 9, 9, 128)    295040      up_sampling2d_23[0][0]           
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 9, 9, 128)    295040      up_sampling2d_26[0][0]           
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 9, 9, 128)    295040      up_sampling2d_29[0][0]           
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 9, 9, 128)    0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 9, 9, 128)    0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 9, 9, 128)    0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 9, 9, 128)    0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 9, 9, 128)    0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 9, 9, 128)    0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 9, 9, 128)    0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 9, 9, 128)    0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 9, 9, 128)    0           conv2d_26[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 9, 9, 128)    0           conv2d_29[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 18, 18, 128)  0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 18, 18, 128)  0           leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
up_sampling2d_9 (UpSampling2D)  (None, 18, 18, 128)  0           leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
up_sampling2d_12 (UpSampling2D) (None, 18, 18, 128)  0           leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
up_sampling2d_15 (UpSampling2D) (None, 18, 18, 128)  0           leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
up_sampling2d_18 (UpSampling2D) (None, 18, 18, 128)  0           leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
up_sampling2d_21 (UpSampling2D) (None, 18, 18, 128)  0           leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
up_sampling2d_24 (UpSampling2D) (None, 18, 18, 128)  0           leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
up_sampling2d_27 (UpSampling2D) (None, 18, 18, 128)  0           leaky_re_lu_26[0][0]             
__________________________________________________________________________________________________
up_sampling2d_30 (UpSampling2D) (None, 18, 18, 128)  0           leaky_re_lu_29[0][0]             
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 18, 18, 64)   73792       up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 18, 18, 64)   73792       up_sampling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 18, 18, 64)   73792       up_sampling2d_9[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 18, 18, 64)   73792       up_sampling2d_12[0][0]           
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 18, 18, 64)   73792       up_sampling2d_15[0][0]           
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 18, 18, 64)   73792       up_sampling2d_18[0][0]           
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 18, 18, 64)   73792       up_sampling2d_21[0][0]           
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 18, 18, 64)   73792       up_sampling2d_24[0][0]           
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 18, 18, 64)   73792       up_sampling2d_27[0][0]           
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 18, 18, 64)   73792       up_sampling2d_30[0][0]           
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 18, 18, 64)   0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 18, 18, 64)   0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 18, 18, 64)   0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 18, 18, 64)   0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 18, 18, 64)   0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 18, 18, 64)   0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 18, 18, 64)   0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 18, 18, 64)   0           conv2d_24[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 18, 18, 64)   0           conv2d_27[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 18, 18, 64)   0           conv2d_30[0][0]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 90, 18, 64)   0           leaky_re_lu_3[0][0]              
                                                                 leaky_re_lu_6[0][0]              
                                                                 leaky_re_lu_9[0][0]              
                                                                 leaky_re_lu_12[0][0]             
                                                                 leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 90, 18, 64)   0           leaky_re_lu_18[0][0]             
                                                                 leaky_re_lu_21[0][0]             
                                                                 leaky_re_lu_24[0][0]             
                                                                 leaky_re_lu_27[0][0]             
                                                                 leaky_re_lu_30[0][0]             
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 90, 36, 64)   0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
cropping2d_1 (Cropping2D)       (None, 76, 34, 64)   0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 76, 34, 6)    390         cropping2d_1[0][0]               
==================================================================================================
Total params: 8,598,790
Trainable params: 8,598,790
Non-trainable params: 0
__________________________________________________________________________________________________
Train on 2541 samples, validate on 636 samples

